{
    "task_type": null,
    "peft_type": "LORA",
    "auto_mapping": null,
    "base_model_name_or_path": null,
    "revision": null,
    "inference_mode": false,
    "r": 128,
    "target_modules": [
        "to_k",
        "to_q",
        "to_out.0",
        "to_v"
    ],
    "exclude_modules": null,
    "lora_alpha": 64,
    "lora_dropout": 0.0,
    "fan_in_fan_out": false,
    "bias": "none",
    "use_rslora": false,
    "modules_to_save": null,
    "init_lora_weights": true,
    "layers_to_transform": null,
    "layers_pattern": null,
    "rank_pattern": {},
    "alpha_pattern": {},
    "megatron_config": null,
    "megatron_core": "megatron.core",
    "loftq_config": {},
    "eva_config": null,
    "use_dora": false,
    "layer_replication": null,
    "lora_bias": false
}